Revit 2027 API
RoutingPreferenceManager.GetSharedSizes Method
 Gets a list of all segments of a given profile shape that define a given size.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetSharedSizes(
	double size,
	ConnectorProfileType shape
)
Public Function GetSharedSizes (
	size As Double,
	shape As ConnectorProfileType
) As IList(Of ElementId)
public:
IList<ElementId^>^ GetSharedSizes(
	double size,
	ConnectorProfileType shape
)
member GetSharedSizes :
        size : float *
        shape : ConnectorProfileType -> IList<ElementId>
Parameters
size Double
 The size to search for.
shape ConnectorProfileType
 The profile shape of segment object.
Return Value
IList<ElementId>
 A list of all segments that define a given size.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RoutingPreferenceManager Class
Autodesk.Revit.DB Namespace